toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//    {
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Delay(_Scheduler::Ms(1000));
//        
////        debugSignal();
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Delay(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Delay(_Scheduler::Ms(250));
//        }
//    }
    
//    // Handle cold starts
//    if (Startup::ColdStart()) {
//        // Temporarily enable a pullup on HOST_MODE_ so that we can determine whether STM is driving it low.
//        // We don't want the pullup to be permanent to prevent leakage current (~80nA) through STM32's GPIO
//        // that controls HOST_MODE_.
//        _Pin::HOST_MODE_::Write(1);
//        
//        // Wait for the pullup to pull the rail up
//        _Scheduler::Delay(_Scheduler::Ms(1));
//        
//        // Enter host mode if HOST_MODE_ is asserted
//        if (!_Pin::HOST_MODE_::Read()) {
//            _HostMode();
//        }
//        
//        // Return to default HOST_MODE_ config
//        // Not using GPIO::Init() here because it costs a lot more instructions.
//        _Pin::HOST_MODE_::Write(0);
//        
//        // Since this is a cold start, delay 3s before beginning.
//        // This delay is meant for the case where we restarted due to an abort, and
//        // serves 2 purposes:
//        //   1. it rate-limits aborts, in case there's a persistent issue
//        //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//        _Scheduler::Delay(_Scheduler::Ms(3000));
//    }
    
    _Scheduler::Run();
}




//#warning TODO: remove these debug symbols
//#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
//constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
//constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
//constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
//constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
//constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
//constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
//
//struct _DebugStack {
//    uint16_t stack[_StackGuardCount];
//};
//
//const _DebugStack& _Debug_MainStack               = *(_DebugStack*)_StackMain;
//const _DebugStack& _Debug_MainTaskStack         = *(_DebugStack*)_MainTask::Stack;
//const _DebugStack& _Debug_SDTaskStack             = *(_DebugStack*)_SDTask::Stack;
//const _DebugStack& _Debug_ImgTaskStack            = *(_DebugStack*)_ImgTask::Stack;
